const roleGroupsworld = [
  {
    title: "🌸 春綺樓",
    roles: [
      ["狼蛛的小寶貝", { name: "狼蛛的小寶貝", id: "1388161251229831200" }],
      ["白貂的苦命情人", { name: "白貂的苦命情人", id: "1388161275435024516" }],
      ["雙頭蛇的小狗狗", { name: "雙頭蛇的小狗狗", id: "1388161296922447952" }]
    ]
  },
  {
    title: "🏜️ 沙瑪沙姆",
    roles: [
      ["律嵂的小妹妹", { name: "律嵂的小妹妹", id: "1388159070447472640" }],
      ["緋霏的小馬鈴薯", { name: "緋霏的小馬鈴薯", id: "1388159082355228834" }],
      ["丹䒟的小東西", { name: "丹䒟的小東西", id: "1388159045013209309" }]
    ]
  },
  {
    title: "🩶 繡骨臺",
    roles: [
      ["平蘋的娘親", { name: "平蘋的娘親", id: "1388159057424158770" }],
      ["安萻的小妻女", { name: "安萻的小妻女", id: "1388159059940610048" }],
      ["佐左的主人", { name: "佐左的主人", id: "1388159054794461234" }],
      ["佑釉的小霸王", { name: "佑釉的小霸王", id: "1388159063078211654" }],
      ["嶽昀的小娘子", { name: "嶽昀的小娘子", id: "1388159090714218507" }]
    ]
  },
  {
    title: "🥀 藍薔薇",
    roles: [
      ["梅玫的小蝴蝶", { name: "梅玫的小蝴蝶", id: "1388159075443019778" }],
      ["甯檸的神經元", { name: "甯檸的神經元", id: "1388159079809155142" }],
      ["卉蕙的小軟糖", { name: "卉蕙的小軟糖", id: "1388159088298295397" }],
      ["梓紫的壞女孩", { name: "梓紫的壞女孩", id: "1388159077682774046" }],
      ["卿清的小公主", { name: "卿清的小公主", id: "1390408362302247053" }]
      ]
    }
];

module.exports = roleGroupsworld;
