const roleGroupsworld = [
  {
    title: "🌸 春綺樓",
    roles: [
      ["狼蛛的小寶貝", { name: "li", id: "1388161251229831200" }],
      ["白貂的苦命情人", { name: "hugh", id: "1388161275435024516" }],
      ["雙頭蛇的小狗狗", { name: "snake", id: "1388161296922447952" }]
    ]
  },
  {
    title: "🏜️ 沙瑪沙姆",
    roles: [
      ["律嵂的小妹妹", { name: "lu", id: "1388159070447472640" }],
      ["緋霏的小馬鈴薯", { name: "fei", id: "1388159082355228834" }],
      ["丹䒟的小東西", { name: "dan", id: "1388159045013209309" }]
    ]
  },
  {
    title: "🩶 繡骨臺",
    roles: [
      ["平蘋的娘親", { name: "ping", id: "1388159057424158770" }],
      ["安萻的小妻女", { name: "an", id: "1388159059940610048" }],
      ["佐左的主人", { name: "zuo", id: "1388159054794461234" }],
      ["佑釉的小霸王", { name: "yo", id: "1388159063078211654" }],
      ["嶽昀的小娘子", { name: "yue", id: "1388159090714218507" }]
    ]
  },
  {
    title: "🥀 藍薔薇",
    roles: [
      ["梅玫的小蝴蝶", { name: "mei", id: "1388159075443019778" }],
      ["甯檸的神經元", { name: "ning", id: "1388159079809155142" }],
      ["卉蕙的小軟糖", { name: "hui", id: "1388159088298295397" }],
      ["梓紫的壞女孩", { name: "zi", id: "1388159077682774046" }],
      ["卿清的小公主", { name: "die", id: "1390408362302247053" }]
    ]
  }
];

module.exports = roleGroupsworld;
