const roleGroupsmix = [
  {
    title: "🍌 叔叔哥哥太大",
    roles: [
      ["厲櫟的小魅魔", { name: "厲櫟的小魅魔", id: "1388159085127405692" }],
      ["黛玳的小便當", { name: "黛玳的小便當", id: "1388159092803244184" }],
      ["尹隱深井冰", { name: "尹隱深井冰", id: "1388159051598270485" }],
      ["鄰居的笨寶寶", { name: "鄰居的笨寶寶", id: "1397243831107452979" }]
    ]
  },
   {
    title: "🍆 爸爸太粗",
    roles: [
      ["雙爹的小女兒", { name: "雙爹的小女兒", id: "1388159066743771337" }],
      ["嫣懨的小布丁", { name: "嫣懨的小布丁", id: "1394583776637489172" }]
    ]
  },
  {
    title: "❤️‍🔥 我想...",
    roles: [
      ["世間情", { name: "世間情", id: "1388163416388276386" }]
    ]
  }
];

module.exports = roleGroupsmix;
